In [1]:
import pandas as pd
import numpy as np

### Load data

In [2]:
df = pd.DataFrame(data={'col1' : [0, np.nan, 2, 3, 4, np.nan, np.nan],
                        'col2' : [100, 500, 200, 300, 400, 600, 800]})
df

   col1  col2
0   0.0   100
1   NaN   500
2   2.0   200
3   3.0   300
4   4.0   400
5   NaN   600
6   NaN   800

* Alternatives: isna, notna, notnull, ==np.nan

In [3]:
df.isnull()

    col1   col2
0  False  False
1   True  False
2  False  False
3  False  False
4  False  False
5   True  False
6   True  False

In [4]:
df.isnull().sum()

col1    3
col2    0
dtype: int64

### In the `fillna` function, by specifying `pad` we can fill the `nan` value as follows

In [5]:
df.fillna(method='pad', limit=1)

   col1  col2
0   0.0   100
1   0.0   500
2   2.0   200
3   3.0   300
4   4.0   400
5   4.0   600
6   NaN   800

* Here we can see that the `nan` value after `4.0` is filled with the value previous to it i.e `4.0`

### `limit` flag is for specifying how many `nan` value should be filled

In [6]:
df.fillna(method='pad', limit=2)

   col1  col2
0   0.0   100
1   0.0   500
2   2.0   200
3   3.0   300
4   4.0   400
5   4.0   600
6   4.0   800

* Here we can see that the `nan` value up to limit two has been filled with the value `4.0`

### `nan` backfilling with `bfill`.

In [7]:
df.fillna(method = 'bfill')

   col1  col2
0   0.0   100
1   2.0   500
2   2.0   200
3   3.0   300
4   4.0   400
5   NaN   600
6   NaN   800

In [8]:
df.fillna(method = 'ffill')

   col1  col2
0   0.0   100
1   0.0   500
2   2.0   200
3   3.0   300
4   4.0   400
5   4.0   600
6   4.0   800

* It fills the `NaN` value in backward direction with the value which is before the `NaN`, if we do not specify the limit, it'll fill all the values with `NaN`

In [9]:
df.dropna(axis=0)

   col1  col2
0   0.0   100
2   2.0   200
3   3.0   300
4   4.0   400

In [10]:
df.dropna(axis=1)

   col2
0   100
1   500
2   200
3   300
4   400
5   600
6   800

### Only drop columns which have at least 90% non-NaNs

In [11]:
df.dropna(thresh=int(df.shape[0] * .9), axis=1)

   col2
0   100
1   500
2   200
3   300
4   400
5   600
6   800

The parameter `thresh=N`requires that a column has at least `N` `non-NaNs` to survive. Think of this as the lower limit for missing data you will find acceptable in your columns.

In [12]:
df.shape[0] * .9

6.3

* The col1 need atleast `6.3 Non NaN` value to survive

### Fill with the mean

In [13]:
df['col1'].fillna(df['col1'].mean())

0    0.00
1    2.25
2    2.00
3    3.00
4    4.00
5    2.25
6    2.25
Name: col1, dtype: float64

### Interpolation

In [14]:
df['col1'].interpolate()

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    4.0
6    4.0
Name: col1, dtype: float64

### Replace

In [15]:
df.replace(np.nan, 0)

   col1  col2
0   0.0   100
1   0.0   500
2   2.0   200
3   3.0   300
4   4.0   400
5   0.0   600
6   0.0   800

### inf and -inf

In [16]:
df = pd.DataFrame(data = {'col1': [np.nan, -np.inf, 2, 3, 4, np.inf, np.nan],
                          'col2': [1, -np.inf, 2, 3, 4, 6, 8]})
df

       col1      col2
0       NaN  1.000000
1      -inf      -inf
2  2.000000  2.000000
3  3.000000  3.000000
4  4.000000  4.000000
5       inf  6.000000
6       NaN  8.000000

In [17]:
df.isna().sum()

col1    2
col2    0
dtype: int64

In [18]:
df.sum()

col1    NaN
col2   -inf
dtype: float64

* If you want to consider inf and -inf to be “NA” in computations, you can set pandas.options.mode.use_inf_as_na = True.

In [19]:
pd.options.mode.use_inf_as_na = True

In [20]:
df.isna().sum()

col1    4
col2    1
dtype: int64

In [21]:
df.sum()

col1     9.0
col2    24.0
dtype: float64